In [1]:
import cx_Oracle

In [2]:
con=cx_Oracle.connect('feb22_mounicka/feb22_mounicka@orcl-aws.c8sefhobaih4.ap-south-1.rds.amazonaws.com:1521/ORCL')
print(con.version)

12.1.0.2.0

In [3]:
import cx_Oracle

try:
    con=cx_Oracle.connect('feb22_mounicka/feb22_mounicka@orcl-aws.c8sefhobaih4.ap-south-1.rds.amazonaws.com:1521/ORCL')
    print(con.version)
    
    cursor=con.cursor()
    cursor.execute("create table employee_10(empid integer primary key,name varchar2(30),salary number(10,2))")
    
    print("Table created successfully")
    
finally:
    if cursor:
        cursor.close()
    if con:
        con.close()

12.1.0.2.0

DatabaseError: ORA-00955: name is already used by an existing object

In [4]:
#connection creation for oracle
#creating cursor
con=cx_Oracle.connect("feb22_mounicka/feb22_mounicka@orcl-aws.c8sefhobaih4.ap-south-1.rds.amazonaws.com:1521/ORCL")
cur=con.cursor()

In [5]:
#executing query using cursor
cur.execute("insert into employee_10 values(10,'vijay','500000.00')")

In [6]:
import pandas as pd

In [7]:
#to read data from the table as a dataframe
df=pd.read_sql("select name,salary from employee_10",con=con)

In [8]:
df

    NAME    SALARY
0  vijay  500000.0

In [9]:
#converting dataframe to csv
df.to_csv('dbcsv.csv')

In [10]:
pd.read_csv('dbcsv.csv')

   Unnamed: 0   NAME    SALARY
0           0  vijay  500000.0

In [11]:
df.to_csv("df.csv")

In [12]:
df.to_excel('df.xlsx')

In [13]:
cur.execute('select * from tab')

In [14]:
pd.read_sql('select *from tab', con=con)

              TNAME TABTYPE CLUSTERID
0             UNIQU   TABLE      None
1        TREAT_TYPE   TABLE      None
2         TREATMENT   TABLE      None
3                T1   TABLE      None
4               SRC   TABLE      None
5      SALES_RETAIL   TABLE      None
6            RESORT   TABLE      None
7    PRODUCT_RETAIL   TABLE      None
8    PRODUCT_ITEAMS   TABLE      None
9           PRODUCT   TABLE      None
10    PAT_TREATMENT   TABLE      None
11         PATIENT1   TABLE      None
12          PATIENT   TABLE      None
13         LOCATION   TABLE      None
14    LOAN_CUSTOMER   TABLE      None
15             JOBS   TABLE      None
16      EMPLOYEE_10   TABLE      None
17        EMPLOYEE1   TABLE      None
18              EMP   TABLE      None
19       ELECTRONIC   TABLE      None
20              DUP   TABLE      None
21          DOCTOR1   TABLE      None
22           DOCTOR   TABLE      None
23             DEPT   TABLE      None
24       DEPARTMENT   TABLE      None
25  CUSTOMER_RETAIL   TABLE      None
26    CUSTOMER_DAY6   TABLE      None
27        CUSTOMER2   TABLE      None
28         CUSTOMER   TABLE      None
29             CUST   TABLE      None
30          COUNTRY   TABLE      None
31        CHOCOLATE   TABLE      None
32             CASE   TABLE      None
33                B   TABLE      None
34                A   TABLE      None

In [15]:
df.to_sql('emp1',con=con)

DatabaseError: Execution failed on sql 'SELECT name FROM sqlite_master WHERE type='table' AND name=?;': ORA-01036: illegal variable name/number